from aiogram import Router
from aiogram.filters import Command, CommandStart
from aiogram.types import Message

router = Router()


@router.message(CommandStart())
async def cmd_start(message: Message):
    await message.answer(
        "👋 Привіт! Цей бот надсилає розклад з посиланнями(якщо додані адміністратором),щоб не забувати про пари\n\n"
        "/help - Отримани гайд\n", parse_mode="HTML"
    )


@router.message(Command("help"))
async def cmd_help(message: Message):
    if message.chat.type == "private":
        text = (
            "Цей бот надсилає розклад з посиланнями(якщо додані адміністратором),щоб не забувати про пари \n\n"
            "📋 <b>Основні команди:</b>\n"
            "• /register — зареєструвати групу у чаті (використовується у груповому чаті)\n"
            "• /my_groups — переглянути ваші зареєстровані групи\n"
            "• /list_links — переглянути всі посилання для вибраної групи\n"
            "• /setting_links — додати, оновити або видалити посилання для занять\n"
            "На кожен тип занять можна зробити необмежену кількість посилань(наприклад, відмітка, міт, методичка). "
            "Редагувати та видаляти посилання для одного предмету можна одразу для декількох посилань.\n"
            "⚙️ <b>Детальніше про дії:</b>\n"
            "— Після команди /setting_links оберіть:\n"
            "   🔹 Додати посилання — створює нове посилання для предмету та типу/типів заняття\n"
            "   🔹 Оновити посилання — змінює існуючі посилання та/або назви\n"
            "   🔹 Видалити посилання — видаляє вибрані посилання\n\n"
            "👨‍💻 Питання, помилки або рекомендації? Пишіть адміністратору в профілі бота\n\n"
            "P.S. Помилки в розкладі - це помилки в апі, не в боті"
        )
    else:
        text = (
            "Цей бот надсилає розклад з посиланнями(якщо додані адміністратором),щоб не забувати про пари\n\n"
            "📋 <b>Основні команди:</b>\n"
            "• /register — зареєструвати групу у чаті\n"
            "• /change_group — змінити групу\n"
            "• /schedule_today /schedule_week — розклад на сьогодні/тиждень\n"
            "• /sync_schedule — оновити розклад\n"
            "• /private_me /stop_private — повідомляти у приватні/зупинити повідомлння\n\n"
            "👨‍💻 Питання, помилки або рекомендації? Пишіть адміністратору в профілі бота\n\n"
            "P.S. Помилки в розкладі - це помилки в апі, не в боті"
        )
    await message.answer(text, parse_mode="HTML")
